src/InformationRegisters/НастройкиПодключенияВЕТИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПодключенияВЕТИС</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Ключ</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Логин</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Администратор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПользователиВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Таймаут</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВремяОжиданияОбработкиЗаявки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнтервалМеждуЗапросамиСинхронизации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КоличествоПовторныхЗапросов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправлятьЗапросыПовторно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИнтервалЗапросаИзмененныхДанных</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ХозяйствующийСубъект</Name>
					<Comment>Хозяйствующий субъект</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйствующиеСубъектыВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/ХозяйствующиеСубъектыВЕТИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ХозяйствующиеСубъектыВЕТИС</Name>
			<Comment>Хозяйствующие субъекты ВетИС</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Comment>Полное наименование, например, для печати</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Comment>Тип субъекта</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ФормыСобственности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФИО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерПаспорта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИНН</Name>
					<Comment>Идентификационный номер налогоплательщика</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>12</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КПП</Name>
					<Comment>Код причины постановки на учет</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>9</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОГРН</Name>
					<Comment>Основной государственный регистрационный номер</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>13</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЮридическийАдрес</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Comment>Подотчетное лицо</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТранспортноеСредство</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Прицеп</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТранспортныеСредства</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СпособХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыХраненияВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НазначениеГруза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НазначенияГрузаВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БлагополучиеМестности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БлагополучиеМестностиВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапрещатьГаситьВСДБезВСЭ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапасСрокаГодности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Предприятия</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Предприятие</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПредприятияВЕТИС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТорговыйОбъект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОсновнойОтдел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>GLN</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОчищатьНули</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаменятьПрефикс</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Префикс</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>5</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/ПользователиВЕТИС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Catalog>
		<Properties>
			<Name>ПользователиВЕТИС</Name>
			<Comment>Пользователи ВетИС</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Логин</Name>
					<Comment>Учетная запись, полученная при создании и связывании пользователя с хозяйствующим субъектом</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПолное</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийТелефон</Name>
					<Comment>Рабочий телефон</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РабочийEmail</Name>
					<Comment>Рабочий email </Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь информационной базы</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеКонтролироватьНазначениеГруза</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоГосударственныйВетеринарныйВрач</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторЗаписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пароль</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХозяйствующийСубъект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ХозяйствующиеСубъектыВЕТИС</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПраваДоступа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Описание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/InformationRegisters/НастройкиПодключенияВЕТИС/Forms/ФормаНовогоПодключения/Ext/Form/Module.bsl
&НаСервере
Процедура ОбработатьИдентификаторХозСубъекта(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ХозяйствующиеСубъектыВЕТИС.Ссылка
	|ИЗ
	|	Справочник.ХозяйствующиеСубъектыВЕТИС КАК ХозяйствующиеСубъектыВЕТИС
	|ГДЕ
	|	ХозяйствующиеСубъектыВЕТИС.Код = &Код
	|";
	Запрос.УстановитьПараметр("Код", ИдентификаторРСХН);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ХозяйствующийСубъект = Выборка.Ссылка;
		Модифицированность = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ХозяйствующийСубъект) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	НовыйХозСубъект = Справочники.ХозяйствующиеСубъектыВЕТИС.СоздатьЭлемент();
	НовыйХозСубъект.Код          = ИдентификаторРСХН;
	НовыйХозСубъект.Наименование = ИдентификаторРСХН;
	НовыйХозСубъект.Собственный  = Истина;
	
	Попытка
		НовыйХозСубъект.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		Отказ = Истина;
		ТекстОшибки = СтрШаблон(НСтр("ru='Не удалось создать хозяйствующего субъекта ВетИС %1'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КодЯзыка = Метаданные.ОсновнойЯзык.КодЯзыка;
		ЗаписьЖурналаРегистрации(НСтр("ru='Запись хозяйствующего субъекта ВетИС.'", КодЯзыка),
		                         УровеньЖурналаРегистрации.Ошибка,
		                         Метаданные.Справочники.ХозяйствующиеСубъектыВЕТИС,,
		                         ТекстОшибки);
		
		Возврат;
	КонецПопытки;
	
	ХозяйствующийСубъект = НовыйХозСубъект.Ссылка;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЛогинПользователя(Отказ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "
	|ВЫБРАТЬ ПЕРВЫЕ 1
	|	ПользователиВЕТИС.Ссылка
	|ИЗ
	|	Справочник.ПользователиВЕТИС КАК ПользователиВЕТИС
	|ГДЕ
	|	ПользователиВЕТИС.Логин = &Логин
	|";
	Запрос.УстановитьПараметр("Логин", ЛогинКабинета);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Администратор = Выборка.Ссылка;
		Модифицированность = Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Администратор) Тогда
		Возврат;
	КонецЕсли;
	
	НачатьТранзакцию();
	
	НовыйПользователь = Справочники.ПользователиВЕТИС.СоздатьЭлемент();
	НовыйПользователь.Логин        = ЛогинКабинета;
	НовыйПользователь.Наименование = ЛогинКабинета;
	НовыйПользователь.Пользователь = Пользователи.ТекущийПользователь();
	НовыйПользователь.ХозяйствующийСубъект   = ХозяйствующийСубъект;
	//НовыйПользователь.Пароль       = Пароль;
	Попытка
		НовыйПользователь.Записать();
		ЗафиксироватьТранзакцию();
	Исключение
		ОтменитьТранзакцию();
		
		Отказ = Истина;
		ТекстОшибки = СтрШаблон(НСтр("ru='Не удалось создать пользователя ВетИС %1'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КодЯзыка = Метаданные.ОсновнойЯзык.КодЯзыка;
		ЗаписьЖурналаРегистрации(НСтр("ru='Запись пользователя ВетИС.'", КодЯзыка),
		                         УровеньЖурналаРегистрации.Ошибка,
		                         Метаданные.Справочники.ПользователиВЕТИС,,
		                         ТекстОшибки);
	КонецПопытки;
	
	Администратор = НовыйПользователь.Ссылка;
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура НачатьПолучениеДанныхХозСубъекта()
	
	СтатусПрогресса = 0;
	
	Элементы.ДлительнаяОперацияПояснение.Заголовок = "Получение хозяйственного субъекта...";
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.ВыводитьПрогрессВыполнения     = Ложь;
	ПараметрыОжидания.ВыводитьОкноОжидания           = Ложь;
	ПараметрыОжидания.ВыводитьСообщения              = Истина;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения = Новый ОписаниеОповещения("ОбработатьПрогресс", ЭтотОбъект);
	
	Задание = НачатьПолучениеДанныхХозСубъектаНаСервере();
	
	ДлительныеОперацииКлиент.ОжидатьЗавершение(
	Задание,
	Новый ОписаниеОповещения("ОбработатьЗавершениеЗадания", ЭтотОбъект),
	ПараметрыОжидания);
	
	//НачатьПолучениеДанныхХозСубъектаНаСервере();
	
КонецПроцедуры

&НаСервере
Функция НачатьПолучениеДанныхХозСубъектаНаСервере()
	
	Отказ = Ложь;
	
	ОбработатьИдентификаторХозСубъекта(Отказ);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОбработатьЛогинПользователя(Отказ);
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОбработатьЗавершениеЗаданияНаСервере(Отказ);
	
	Если Отказ Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	//Если Модифицированность Тогда
	//	Записать();
	//КонецЕсли;
	
	НастройкаПодключения = ИнтеграцияВЕТИС.ПолучитьНастройкуПодключения(ХозяйствующийСубъект);
	//НастройкаПодключения.Вставить("Пользователь", ЛогинКабинета);
	//НастройкаПодключения.Вставить("Логин",        ЛогинAPI);
	//НастройкаПодключения.Вставить("Пароль",       ПарольAPI);
	//НастройкаПодключения.Вставить("Ключ",         КлючХозСубъекта);
	
	ВходныеПараметры = Новый Структура;
	ВходныеПараметры.Вставить("НастройкаПодключения", НастройкаПодключения);
	ВходныеПараметры.Вставить("Прогресс",             "ПолучениеДанныхХозСубъекта");
	ВходныеПараметры.Вставить("ИдентификаторРСХН",    ИдентификаторРСХН);
	
	Элементы.СтраницыСтатусФоновогоЗадания.Видимость       = Истина;
	Элементы.СтраницыСтатусФоновогоЗадания.ТекущаяСтраница = Элементы.ЗаданиеВыполняется;
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.ОжидатьЗавершение = 0;
	
	
	////ПараметрыДанных = Новый Структура;
	////ПараметрыДанных.Вставить("НастройкаПодключения", НастройкаПодключения);
	////ПараметрыДанных.Вставить("Прогресс",             "ПолучениеДанныхХозСубъекта");
	
	Результат = ДлительныеОперации.ВыполнитьВФоне(
	"РегистрыСведений.НастройкиПодключенияВЕТИС.ПолучитьДанныеПоХозСубъекту",
	ВходныеПараметры,
	ПараметрыВыполнения);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ВыполнитьНачальноеЗаполнение(Команда)
	
	Если ПустаяСтрока(ИдентификаторРСХН) Тогда
		ВывестиСообщение(НСтр("ru='Не заполнено поле IssuerID.'"), ЭтотОбъект, "ИдентификаторХозСубъекта");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(КлючХозСубъекта) Тогда
		ВывестиСообщение(НСтр("ru='Не заполнено поле APIKey.'"), ЭтотОбъект, "КлючХозСубъекта");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ЛогинAPI) Тогда
		ВывестиСообщение(НСтр("ru='Не заполнено поле Login.'"), ЭтотОбъект, "Login");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ПарольAPI) Тогда
		ВывестиСообщение(НСтр("ru='Не заполнено поле Password.'"), ЭтотОбъект, "Password");
		Возврат;
	КонецЕсли;
	
	Если ПустаяСтрока(ЛогинКабинета) Тогда
		ВывестиСообщение(НСтр("ru='Не заполнено поле Account name.'"), ЭтотОбъект, "ЛогинКабинета");
		Возврат;
	КонецЕсли;
	
	НачатьПолучениеДанныхХозСубъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьПрогресс(Результат, Параметры) Экспорт
	
	Если ТипЗнч(Результат.Прогресс) = Тип("Структура") Тогда
		Элементы.ДлительнаяОперацияПояснение.Заголовок = "Создание номенклатуры на сервере..." + Формат(Цел(Результат.Прогресс.Процент), "ЧН=0") + "%";
		//ОтобразитьРезультатыОтправки(Результат.Прогресс.ДополнительныеПараметры);
	КонецЕсли;
	
	Если ТипЗнч(Результат.Сообщения) = Тип("ФиксированныйМассив") Тогда
		Для Каждого Сообщение Из Результат.Сообщения Цикл
			Если Сообщение.Текст = "" Тогда
				Продолжить;
			КонецЕсли;
			Если СтрНачинаетсяС(Сообщение.Текст, "{СтандартныеПодсистемы.ДлительныеОперации}<Structure") Тогда
				Продолжить;
			КонецЕсли;
			ВывестиСообщение(Сообщение.Текст);
		КонецЦикла;
		Результат.Сообщения = Новый ФиксированныйМассив(Новый Массив);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ОбработатьЗавершениеЗаданияНаСервере(Отказ)
	
	ЗаголовокОшибки = НСтр("ru='Не удалось записать настройки подключения к ВетИС.API'");
	
	УстановитьПривилегированныйРежим(Истина);
	
	НачатьТранзакцию();
	
	Попытка
		МенеджерЗаписи = РегистрыСведений.НастройкиПодключенияВЕТИС.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ХозяйствующийСубъект = ХозяйствующийСубъект.Ссылка;
		МенеджерЗаписи.Ключ          = КлючХозСубъекта;
		МенеджерЗаписи.Логин         = ЛогинAPI;
		МенеджерЗаписи.Пароль        = ПарольAPI;
		МенеджерЗаписи.Таймаут       = 60;
		МенеджерЗаписи.Администратор = Администратор;
		МенеджерЗаписи.ВремяОжиданияОбработкиЗаявки        = 1800;
		МенеджерЗаписи.ИнтервалМеждуЗапросамиСинхронизации = 10;
		МенеджерЗаписи.КоличествоПовторныхЗапросов         = 15;
		МенеджерЗаписи.ОтправлятьЗапросыПовторно           = Истина;
		МенеджерЗаписи.ИнтервалЗапросаИзмененныхДанных     = 86400;
		МенеджерЗаписи.Записать(Истина);
		
		ЗафиксироватьТранзакцию();
		
		ПараметрыКлюча = Новый Структура;
		ПараметрыКлюча.Вставить("ХозяйствующийСубъект", МенеджерЗаписи.ХозяйствующийСубъект);
		НастройкиПодключенияКлючЗаписи = РегистрыСведений.НастройкиПодключенияВЕТИС.СоздатьКлючЗаписи(ПараметрыКлюча);
		
	Исключение
		ОтменитьТранзакцию();
		
		Отказ = Истина;
		ТекстОшибки = СтрШаблон(НСтр("ru='Не удалось записать настройки подключения к ВетИС.API %1'"), КраткоеПредставлениеОшибки(ИнформацияОбОшибке()));
		КодЯзыка = Метаданные.ОсновнойЯзык.КодЯзыка;
		ЗаписьЖурналаРегистрации(НСтр("ru='Запись настройки подключения ВетИС.'", КодЯзыка),
		                         УровеньЖурналаРегистрации.Ошибка,
		                         Метаданные.РегистрыСведений.НастройкиПодключенияВЕТИС,,
		                         ТекстОшибки);
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьЗавершениеЗадания(Результат, Параметры) Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		
		Элементы.СтраницыСтатусФоновогоЗадания.Видимость = Ложь;
		ПоказатьОповещениеПользователя(НСтр("ru = 'Начальное заполнение выполнено'"));
		
		Если Не НастройкиПодключенияКлючЗаписи = Неопределено Тогда
			ПараметрыОткрытияФормы = Новый Структура;
			ПараметрыОткрытияФормы.Вставить("Ключ", НастройкиПодключенияКлючЗаписи);
			ОткрытьФорму("РегистрСведений.НастройкиПодключенияВЕТИС.ФормаЗаписи", ПараметрыОткрытияФормы,,,,,,РежимОткрытияОкнаФормы.Независимый);
			Закрыть();
		КонецЕсли;
		
	ИначеЕсли Результат.Статус = "Ошибка" Тогда
		
		Элементы.СтраницыСтатусФоновогоЗадания.ТекущаяСтраница = Элементы.ЗаданиеЗавершеноСОшибкой;
		Элементы.ПодробноеПредставлениеОшибки.Заголовок = Результат.ПодробноеПредставлениеОшибки;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.СтраницыСтатусФоновогоЗадания.ТекущаяСтраница = Элементы.ЗаданиеВыполняется;
	Элементы.СтраницыСтатусФоновогоЗадания.Видимость       = Ложь;
	Элементы.ТекстВыполнения.Видимость                     = Ложь;
	
КонецПроцедуры
